In [188]:
import numpy as np
import pandas as pd

## Creating a DataFrame

In [189]:
data = {
    'Name' : ['John', 'Anna' , 'Peter','Linda'],
    'Age': [28,34,29,42],
    'City': ['Newyork', 'Paris' , 'Berlin', 'London'],
    'Salary':[65000,70000,62000,85000]
}
df = pd.DataFrame(data)

In [190]:
df

    Name  Age     City  Salary
0   John   28  Newyork   65000
1   Anna   34    Paris   70000
2  Peter   29   Berlin   62000
3  Linda   42   London   85000

In [191]:
data_list = [
    ['john', 28,'New york',65000],
    ['Anna', 34, 'Paris',70000],
    ['Peter',29,'Berlin',62000],
    ['Linda',42,'London',85000]
]
df2 = pd.DataFrame(data_list)
columns = ["Name", "Age","City","Salary"]
df2 = pd.DataFrame(data_list,columns=columns)
df2

    Name  Age      City  Salary
0   john   28  New york   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [192]:
df2

    Name  Age      City  Salary
0   john   28  New york   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## Selecction and indexing of column

In [193]:
df2

    Name  Age      City  Salary
0   john   28  New york   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [194]:
df2['Name']

0     john
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [195]:
df2['City']

0    New york
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [196]:
df2[["Name", "City"]]

    Name      City
0   john  New york
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

## Creating a new column

In [197]:
df2["Designation"] = ["Doctor", "Eng." , "Doctor","Eng."]

In [198]:
df2

    Name  Age      City  Salary Designation
0   john   28  New york   65000      Doctor
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000        Eng.

In [199]:
df2

    Name  Age      City  Salary Designation
0   john   28  New york   65000      Doctor
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000        Eng.

## Removing column

In [200]:
df2.drop("Designation",axis = 1,inplace=True)

In [201]:
df2

    Name  Age      City  Salary
0   john   28  New york   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [202]:
df2.drop(0,axis =0)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [203]:
df2

    Name  Age      City  Salary
0   john   28  New york   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## selecting Rows

In [204]:
df2

    Name  Age      City  Salary
0   john   28  New york   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [205]:
df2.loc[[0,1]]

   Name  Age      City  Salary
0  john   28  New york   65000
1  Anna   34     Paris   70000

In [206]:
df.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

## Selecting Subsets of Rows and Column

In [207]:
df2

    Name  Age      City  Salary
0   john   28  New york   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [208]:
df.loc[[0,1]][["City","Salary"]]

      City  Salary
0  Newyork   65000
1    Paris   70000

In [209]:
df.loc[[2,3]][["Name","Age"]]

    Name  Age
2  Peter   29
3  Linda   42

## Conditional selection

In [210]:
df2

    Name  Age      City  Salary
0   john   28  New york   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [212]:
# I only want to see those people whose age is above 30

In [211]:
df2[df2["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [213]:
# I only want to see those people whose age is above 30 and their city must be Paris

In [217]:
df2[(df2["Age"]>30) & (df2["City"] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000